This nb will focus on mean_brand_prices and continuation of the prev. nb on german resold cars db.

In [1]:
import pandas as pd
import numpy as np

In [2]:
autos = pd.read_csv('autos.csv', encoding = 'Latin - 1')
autos.head()

,dateCrawled,name,seller,offerType,price,abtest,vehicleType,yearOfRegistration,gearbox,powerPS,model,kilometer,monthOfRegistration,fuelType,brand,notRepairedDamage,dateCreated,nrOfPictures,postalCode,lastSeen
0,2016-03-24 11:52:17,Golf_3_1.6,privat,Angebot,480,test,NaN,1993,manuell,0,golf,150000,0,benzin,volkswagen,NaN,2016-03-24 00:00:00,0,70435,2016-04-07 03:16:57
1,2016-03-24 10:58:45,A5_Sportback_2.7_Tdi,privat,Angebot,18300,test,coupe,2011,manuell,190,NaN,125000,5,diesel,audi,ja,2016-03-24 00:00:00,0,66954,2016-04-07 01:46:50
2,2016-03-14 12:52:21,"Jeep_Grand_Cherokee_""Overland""",privat,Angebot,9800,test,suv,2004,automatik,163,grand,125000,8,diesel,jeep,NaN,2016-03-14 00:00:00,0,90480,2016-04-05 12:47:46
3,2016-03-17 16:54:04,GOLF_4_1_4__3TÜRER,privat,Angebot,1500,test,kleinwagen,2001,manuell,75,golf,150000,6,benzin,volkswagen,nein,2016-03-17 00:00:00,0,91074,2016-03-17 17:40:17
4,2016-03-31 17:25:20,Skoda_Fabia_1.4_TDI_PD_Classic,privat,Angebot,3600,test,kleinwagen,2008,manuell,69,fabia,90000,7,diesel,skoda,nein,2016-03-31 00:00:00,0,60437,2016-04-06 10:17:21

In [3]:
autos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 371528 entries, 0 to 371527
Data columns (total 20 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   dateCrawled          371528 non-null  object
 1   name                 371528 non-null  object
 2   seller               371528 non-null  object
 3   offerType            371528 non-null  object
 4   price                371528 non-null  int64
 5   abtest               371528 non-null  object
 6   vehicleType          333659 non-null  object
 7   yearOfRegistration   371528 non-null  int64
 8   gearbox              351319 non-null  object
 9   powerPS              371528 non-null  int64
 10  model                351044 non-null  object
 11  kilometer            371528 non-null  int64
 12  monthOfRegistration  371528 non-null  int64
 13  fuelType             338142 non-null  object
 14  brand                371528 non-null  object
 15  notRepairedDamage    299468 non-null  object
 16  dateCreated          371528 non-null  object
 17  nrOfPictures         371528 non-null  int64
 18  postalCode           371528 non-null  int64
 19  lastSeen             371528 non-null  object
dtypes: int64(7), object(13)
memory usage: 56.7+ MB

## Let's compute the average price of a brand of car in the dataset

In [4]:
brands = autos['brand'].value_counts(dropna = False).index # This will create a index list with all the unique brand names of the cars.

In [5]:
autos['price'].describe()

count    3.715280e+05
mean     1.729514e+04
std      3.587954e+06
min      0.000000e+00
25%      1.150000e+03
50%      2.950000e+03
75%      7.200000e+03
max      2.147484e+09
Name: price, dtype: float64

In [6]:
autos['price'].value_counts(dropna = False).sort_index()

price
0             10778
1              1189
2                12
3                 8
4                 1
              ...
32545461          1
74185296          1
99000000          1
99999999         15
2147483647        1
Name: count, Length: 5597, dtype: int64

In [7]:
autos = autos[autos['price'].between(100, 100000)] # The price column as unrealistics min. and max. values, the between method is used here to set a up. and lowr. limit

In [8]:
autos['price'].describe()

count    357805.000000
mean       5816.364481
std        7562.614881
min         100.000000
25%        1290.000000
50%        3100.000000
75%        7499.000000
max      100000.000000
Name: price, dtype: float64

In [9]:
mean_prices = {}

for i in brands:
    select_rows = autos[autos['brand'] == i]
    mean_price = select_rows['price'].mean()
    mean_prices[i] = mean_price
mean_prices

{'volkswagen': 5346.779605649998,
 'bmw': 8356.045593643119,
 'opel': 2967.8726353640104,
 'mercedes_benz': 8331.833260686368,
 'audi': 8968.661794750904,
 'ford': 3687.341885902493,
 'renault': 2420.906007639773,
 'peugeot': 3252.8696786213322,
 'fiat': 2888.512213494028,
 'seat': 4478.6206592113,
 'mazda': 4050.180500181225,
 'skoda': 6476.05411722402,
 'smart': 3597.9994177018634,
 'citroen': 3726.481762009169,
 'nissan': 4680.591748768473,
 'toyota': 5290.963573287077,
 'sonstige_autos': 11782.765217391305,
 'hyundai': 5520.930928411633,
 'mini': 9972.737988660101,
 'volvo': 5228.114214773433,
 'mitsubishi': 3358.518505942275,
 'honda': 3965.3395810363836,
 'kia': 5811.065540812224,
 'alfa_romeo': 4291.7800089245875,
 'suzuki': 4011.1482300884954,
 'porsche': 34137.953592814374,
 'chevrolet': 7129.761611639619,
 'chrysler': 4159.222384784199,
 'dacia': 5918.533783783784,
 'jeep': 11128.851472471191,
 'daihatsu': 1792.646517739816,
 'subaru': 4478.277401894452,
 'land_rover': 16602.37880794702,
 'jaguar': 12233.358585858587,
 'trabant': 2004.5189075630253,
 'daewoo': 1044.530303030303,
 'saab': 3923.6802325581393,
 'rover': 1606.145652173913,
 'lancia': 3315.91341991342,
 'lada': 3223.235849056604}

## Let's compute the average distance of a brand of cars been driven.

In [10]:
autos['kilometer'].describe()

count    357805.000000
mean     125871.606042
std       39527.680681
min        5000.000000
25%      125000.000000
50%      150000.000000
75%      150000.000000
max      150000.000000
Name: kilometer, dtype: float64

In [11]:
autos['kilometer'].value_counts(dropna = False)

kilometer
150000    231509
125000     37222
100000     15349
90000      12319
80000      10859
70000       9635
60000       8563
50000       7505
40000       6295
30000       5890
20000       5452
5000        5406
10000       1801
Name: count, dtype: int64

In [12]:
mean_miles = {}

for i in brands:
    select_rows = autos[autos['brand'] == i]
    miles = select_rows['kilometer'].mean()
    mean_miles[i] = miles
mean_miles

{'volkswagen': 128736.5904012753,
 'bmw': 133137.93812842338,
 'opel': 128960.21157955079,
 'mercedes_benz': 130923.48821666231,
 'audi': 129847.71334276284,
 'ford': 123943.19521815151,
 'renault': 128074.42991086931,
 'peugeot': 124852.35211923614,
 'fiat': 116993.43591950931,
 'seat': 121172.74867569159,
 'mazda': 125881.66002174701,
 'skoda': 113759.43905070118,
 'smart': 100547.3602484472,
 'citroen': 120556.10922862268,
 'nissan': 119617.20032840723,
 'toyota': 117304.85689505638,
 'sonstige_autos': 89590.06211180124,
 'hyundai': 104630.87248322148,
 'mini': 94409.13160250672,
 'volvo': 138274.36374922408,
 'mitsubishi': 127062.81833616299,
 'honda': 126095.18559353179,
 'kia': 109569.7627663852,
 'alfa_romeo': 129511.37884872824,
 'suzuki': 106909.29203539823,
 'porsche': 103507.98403193612,
 'chevrolet': 100363.73810856184,
 'chrysler': 134363.5698610095,
 'dacia': 86272.52252252253,
 'jeep': 121017.9257362356,
 'daihatsu': 119053.87647831801,
 'subaru': 126156.96887686063,
 'land_rover': 119662.25165562914,
 'jaguar': 124469.69696969698,
 'trabant': 55714.28571428572,
 'daewoo': 123835.22727272728,
 'saab': 141027.13178294574,
 'rover': 135445.65217391305,
 'lancia': 124350.64935064936,
 'lada': 74150.94339622642}

In [13]:
# converting dicts. to series objs.
mean_miles = pd.Series(mean_miles).sort_values(ascending = False) 
mean_prices = pd.Series(mean_prices).sort_values(ascending = False)

In [14]:
# Adding series objs. to a dataFrame.

mean_info = pd.DataFrame(mean_miles, columns = ['mean_km']) # create a dataFrame with name 'mean_info'.
mean_info.head()

                mean_km
saab      141027.131783
volvo     138274.363749
rover     135445.652174
chrysler  134363.569861
bmw       133137.938128

In [15]:
mean_info['mean_prices'] = mean_prices # add the series object 'mean_prices' as another column with name 'mean_prices' to the new df 'mean_info'.
mean_info.head()

                mean_km  mean_prices
saab      141027.131783  3923.680233
volvo     138274.363749  5228.114215
rover     135445.652174  1606.145652
chrysler  134363.569861  4159.222385
bmw       133137.938128  8356.045594

In [16]:
mean_info['mean_prices'].sort_values(ascending = False)

porsche           34137.953593
land_rover        16602.378808
jaguar            12233.358586
sonstige_autos    11782.765217
jeep              11128.851472
mini               9972.737989
audi               8968.661795
bmw                8356.045594
mercedes_benz      8331.833261
chevrolet          7129.761612
skoda              6476.054117
dacia              5918.533784
kia                5811.065541
hyundai            5520.930928
volkswagen         5346.779606
toyota             5290.963573
volvo              5228.114215
nissan             4680.591749
seat               4478.620659
subaru             4478.277402
alfa_romeo         4291.780009
chrysler           4159.222385
mazda              4050.180500
suzuki             4011.148230
honda              3965.339581
saab               3923.680233
citroen            3726.481762
ford               3687.341886
smart              3597.999418
mitsubishi         3358.518506
lancia             3315.913420
peugeot            3252.869679
lada               3223.235849
opel               2967.872635
fiat               2888.512213
renault            2420.906008
trabant            2004.518908
daihatsu           1792.646518
rover              1606.145652
daewoo             1044.530303
Name: mean_prices, dtype: float64

We see the cars with brands `saab` and `porsche` have highest km driven and highest prices respectively.

## Most common Models/Brands

In [17]:
models = autos.groupby('model').size().reset_index(name = 'count')
models_sorted = models.sort_values('count', ascending = False, ignore_index = True)
models_sorted.head()

    model  count
0    golf  28912
1  andere  25412
2     3er  19875
3    polo  12533
4   corsa  12042

## Checking price on each kilometer bins.

In [18]:
autos['kilometer'].value_counts(dropna = False)

kilometer
150000    231509
125000     37222
100000     15349
90000      12319
80000      10859
70000       9635
60000       8563
50000       7505
40000       6295
30000       5890
20000       5452
5000        5406
10000       1801
Name: count, dtype: int64

We see there are many cars with the highest kms on their odometers, this indicates the market has many cars driven a lot and less cars that are not driven very much.

In [19]:
autos['kilometer_bins'] = pd.cut(autos['kilometer'], bins = [0, 50000, 100000, 150000, 200000, np.inf], labels = ['<50k', '50K-100K', '100K-150K', '150K-200K', '>200K'])
prices_on_kilos = autos.groupby('kilometer_bins')['price'].mean().reset_index(name = 'mean_price')
prices_on_kilos

  kilometer_bins    mean_price
0           <50k  13804.283935
1       50K-100K   9354.755945
2      100K-150K   4107.903372
3      150K-200K           NaN
4          >200K           NaN

In [20]:
autos.info()

<class 'pandas.core.frame.DataFrame'>
Index: 357805 entries, 0 to 371527
Data columns (total 21 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   dateCrawled          357805 non-null  object
 1   name                 357805 non-null  object
 2   seller               357805 non-null  object
 3   offerType            357805 non-null  object
 4   price                357805 non-null  int64
 5   abtest               357805 non-null  object
 6   vehicleType          324858 non-null  object
 7   yearOfRegistration   357805 non-null  int64
 8   gearbox              341184 non-null  object
 9   powerPS              357805 non-null  int64
 10  model                340102 non-null  object
 11  kilometer            357805 non-null  int64
 12  monthOfRegistration  357805 non-null  int64
 13  fuelType             329032 non-null  object
 14  brand                357805 non-null  object
 15  notRepairedDamage    292608 non-null  object
 16  dateCreated          357805 non-null  object
 17  nrOfPictures         357805 non-null  int64
 18  postalCode           357805 non-null  int64
 19  lastSeen             357805 non-null  object
 20  kilometer_bins       357805 non-null  category
dtypes: category(1), int64(7), object(13)
memory usage: 57.7+ MB

In [23]:
autos['notRepairedDamage'].dropna()
autos['notRepairedDamage'].value_counts(dropna = False)

notRepairedDamage
nein    258897
NaN      65197
ja       33711
Name: count, dtype: int64

In [24]:
# Price diff. btw damaged and undamaged cars

damaged_priz = autos[autos['notRepairedDamage'] == 'ja']['price'].mean()
undamaged_priz = autos[autos['notRepairedDamage'] == 'nein']['price'].mean()
price_diff = (undamaged_priz - damaged_priz) / undamaged_priz * 100

print('Cars without any damaged are {:.2f}% more expensive than damaged ones'.format(price_diff))

Cars without any damaged are 67.51% more expensive than damaged ones

In [26]:
autos['postalCode'].value_counts(dropna = False)

postalCode
10115    821
65428    626
66333    328
38518    308
44145    307
        ...
29587      1
89368      1
95356      1
91471      1
31096      1
Name: count, Length: 8146, dtype: int64

The **highest cars listed are from the postal code of the capital of Germany, Berlin.** This makes sense as in most cases, the capital city is were most people reside and use cars often, where there are most maintained roads available.

In [27]:
autos['dateCrawled'].value_counts(dropna = False)

dateCrawled
2016-03-24 14:49:47    7
2016-03-19 21:49:56    6
2016-03-26 22:57:31    6
2016-03-19 12:50:39    5
2016-03-23 13:50:19    5
                      ..
2016-03-12 17:47:38    1
2016-03-28 15:54:58    1
2016-03-19 12:55:50    1
2016-03-17 19:48:39    1
2016-03-07 19:39:19    1
Name: count, Length: 273018, dtype: int64

There is a single date '2016-03-24 14:49:47' that occurs multiple times more than any other date and time. This can indicate any preceeding marketing from the platform or sale.

Let's find out which fuel type of car is expensive in the resold cars dataset.

To do this we will need to find the average price of cars on one type of fuel and compare them with cars on the other type of fuel.

In [28]:
autos['fuelType'].value_counts(dropna = False)

fuelType
benzin     216790
diesel     105944
NaN         28773
lpg          5222
cng           555
hybrid        268
andere        157
elektro        96
Name: count, dtype: int64

We will compare the car prices of cars with the top two fuel types.

In [35]:
on_benzin = autos[autos['fuelType'] == 'benzin']['price'].mean().round()
on_diesel = autos[autos['fuelType'] == 'diesel']['price'].mean().round()
print('Average cost of cars running on benzin is {0} v/s those running on diesel, {1}'.format(on_benzin, on_diesel))

Average cost of cars running on benzin is 4833.0 v/s those running on diesel, 8590.0

We see Diesel vehicles are costliers than cars running on benzin.

#### Let's find the **costliest average price of cars on all types of available fuels** in our dataset.

In [41]:
fuel_list = autos['fuelType'].value_counts().index
fuel_list

Index(['benzin', 'diesel', 'lpg', 'cng', 'hybrid', 'andere', 'elektro'], dtype='object', name='fuelType')

In [46]:
avg_fuel_price = {}
for fuel in fuel_list:
    avg_fuel_price[fuel] = autos[autos['fuelType'] == fuel]['price'].mean().round()
avg_fuel_price = pd.Series(avg_fuel_price).sort_values(ascending = False)
avg_fuel_price

hybrid     13026.0
elektro    11983.0
diesel      8590.0
benzin      4833.0
cng         4804.0
lpg         4442.0
andere      4279.0
dtype: float64

Thus, we see used cars with hybrid fuel are the costliest than any other fuel category cars in the dataset.

#### Let's do the same to find out the **price ranges of cars from the range of Pfredstroke(PS)or HP.**

In [48]:
autos['powerPS'].value_counts(dropna = False)

powerPS
0        35594
75       23190
60       15363
150      14957
140      13418
         ...
5809         1
15020        1
5867         1
2172         1
564          1
Name: count, Length: 767, dtype: int64

In [50]:
autos['powerPS'].value_counts(dropna = False).sort_index()

powerPS
0        35594
1           24
2            9
3            9
4           30
         ...
17932        1
19208        1
19211        1
19312        1
20000        1
Name: count, Length: 767, dtype: int64

There seems to be unrealistic and incorrect values in the `powerPS` column. As we know from generally available data, that the power range of a car can lie between 150HP to 2000HP, knowing that are no cars in the world that have more than 1900 HP power.

We will thereby set a range on the PowerPS column, inturn cleaning it for the upcoming analysis.

In [53]:
autos = autos[autos['powerPS'].between(100, 2000)]

In [55]:
autos['powerPS'].value_counts(dropna = False).sort_index()

powerPS
100      1421
101     12937
102      6378
103       950
104       134
        ...
1993        1
1995        2
1998        3
1999        1
2000        3
Name: count, Length: 569, dtype: int64

In [61]:
autos['inHP'] = pd.cut(autos['powerPS'], bins = [0, 100, 500, 1000, 1500, 2000], labels = ['0-99', '100-499', '500-999', '1000-1499', '1500-2000'])
avg_fp = autos.groupby('inHP')['price'].mean().reset_index(name = 'avg_price')
avg_fp

C:\Users\Guester\AppData\Local\Temp\ipykernel_13180\3469689658.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  autos['inHP'] = pd.cut(autos['powerPS'], bins = [0, 100, 500, 1000, 1500, 2000], labels = ['0-99', '100-499', '500-999', '1000-1499', '1500-2000'])

        inHP     avg_price
0       0-99   2301.085151
1    100-499   7949.904290
2    500-999  34584.082759
3  1000-1499   2733.715789
4  1500-2000   3213.697368

Ignoring the warning for the time, we see the costliest types of used cars lie in the 500 - 999 HP power range, and cheapest are from 0 - 99.